# ConfigurationReloadInfo Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConfigurationReloadInfo Class
Members See Also
---
This object contains information returned by a reload of the fabrication configuration.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class ConfigurationReloadInfo : IDisposable
```

Visual Basic
---
```text
Public Class ConfigurationReloadInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ConfigurationReloadInfo : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ConfigurationReloadInfo
# See Also
ConfigurationReloadInfo Members
Autodesk.Revit.DB Namespace